list_metadata_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata">
   <soapenv:Header>
      <met:SessionHeader>
         <met:sessionId>%s</met:sessionId>
      </met:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <met:listMetadata>
         <met:queries>
          %s
         </met:queries>
         <met:asOfVersion>33.0</met:asOfVersion>
      </met:listMetadata>
   </soapenv:Body>
</soapenv:Envelope>
